app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'diszaid@gmail.com'
 LIMIT 1
---
    public function valid_login()
    {
        //ambil data dari form
        $data = $this->request->getPost();

        //ambil data user di database yang usernamenya sama
        $user = $this->userModel->where('username', $data['username'])->first();